Luos-io/Arduino_core/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Luos adapted Arduino Zero (Prorgamming Port)
# ---------------------------------------
luos_arduino_zero_edbg.name=Luos adapted Arduino Zero (Programming Port)
luos_arduino_zero_edbg.vid.0=0x03eb
luos_arduino_zero_edbg.pid.0=0x2157

luos_arduino_zero_edbg.upload.tool=openocd
luos_arduino_zero_edbg.upload.protocol=sam-ba
luos_arduino_zero_edbg.upload.maximum_size=262144
luos_arduino_zero_edbg.upload.maximum_data_size=32768
luos_arduino_zero_edbg.upload.use_1200bps_touch=false
luos_arduino_zero_edbg.upload.wait_for_upload_port=false
luos_arduino_zero_edbg.upload.native_usb=false
luos_arduino_zero_edbg.build.mcu=cortex-m0plus
luos_arduino_zero_edbg.build.f_cpu=48000000L
luos_arduino_zero_edbg.build.usb_product="Arduino Zero"
luos_arduino_zero_edbg.build.usb_manufacturer="Arduino LLC"
luos_arduino_zero_edbg.build.board=SAMD_ZERO
luos_arduino_zero_edbg.build.core=arduino
luos_arduino_zero_edbg.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
luos_arduino_zero_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_arduino_zero_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_arduino_zero_edbg.build.variant=arduino_zero-luos
luos_arduino_zero_edbg.build.variant_system_lib=
luos_arduino_zero_edbg.build.vid=0x2341
luos_arduino_zero_edbg.build.pid=0x804d
luos_arduino_zero_edbg.bootloader.tool=openocd
luos_arduino_zero_edbg.bootloader.file=zero/samd21_sam_ba.bin

# Luos adapted Arduino Zero (Native USB Port)
# --------------------------------------
luos_arduino_zero_native.name=Luos adapted Arduino Zero (Native USB Port)
luos_arduino_zero_native.vid.0=0x2341
luos_arduino_zero_native.pid.0=0x804d
luos_arduino_zero_native.vid.1=0x2341
luos_arduino_zero_native.pid.1=0x004d
luos_arduino_zero_native.vid.2=0x2341
luos_arduino_zero_native.pid.2=0x824d
luos_arduino_zero_native.vid.3=0x2341
luos_arduino_zero_native.pid.3=0x024d

luos_arduino_zero_native.upload.tool=bossac
luos_arduino_zero_native.upload.protocol=sam-ba
luos_arduino_zero_native.upload.maximum_size=262144
luos_arduino_zero_native.upload.maximum_data_size=32768
luos_arduino_zero_native.upload.use_1200bps_touch=true
luos_arduino_zero_native.upload.wait_for_upload_port=true
luos_arduino_zero_native.upload.native_usb=true
luos_arduino_zero_native.build.mcu=cortex-m0plus
luos_arduino_zero_native.build.f_cpu=48000000L
luos_arduino_zero_native.build.usb_product="Arduino Zero"
luos_arduino_zero_native.build.usb_manufacturer="Arduino LLC"
luos_arduino_zero_native.build.board=SAMD_ZERO
luos_arduino_zero_native.build.core=arduino
luos_arduino_zero_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
luos_arduino_zero_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_arduino_zero_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_arduino_zero_native.build.variant=arduino_zero-luos
luos_arduino_zero_native.build.variant_system_lib=
luos_arduino_zero_native.build.vid=0x2341
luos_arduino_zero_native.build.pid=0x804d
luos_arduino_zero_native.bootloader.tool=openocd
luos_arduino_zero_native.bootloader.file=zero/samd21_sam_ba.bin

# Luos adapted Arduino MKR1000
# -----------------------
luos_mkr1000.name=Luos adapted Arduino MKR1000
luos_mkr1000.vid.0=0x2341
luos_mkr1000.pid.0=0x804e
luos_mkr1000.vid.1=0x2341
luos_mkr1000.pid.1=0x004e
luos_mkr1000.vid.2=0x2341
luos_mkr1000.pid.2=0x824e
luos_mkr1000.vid.3=0x2341
luos_mkr1000.pid.3=0x024e

luos_mkr1000.upload.tool=bossac
luos_mkr1000.upload.protocol=sam-ba
luos_mkr1000.upload.maximum_size=262144
luos_mkr1000.upload.maximum_data_size=32768
luos_mkr1000.upload.use_1200bps_touch=true
luos_mkr1000.upload.wait_for_upload_port=true
luos_mkr1000.upload.native_usb=true
luos_mkr1000.build.mcu=cortex-m0plus
luos_mkr1000.build.f_cpu=48000000L
luos_mkr1000.build.usb_product="Arduino MKR1000"
luos_mkr1000.build.usb_manufacturer="Arduino LLC"
luos_mkr1000.build.board=SAMD_MKR1000
luos_mkr1000.build.core=arduino
luos_mkr1000.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
luos_mkr1000.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkr1000.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkr1000.build.variant=mkr1000-luos
luos_mkr1000.build.vid=0x2341
luos_mkr1000.build.pid=0x804e
luos_mkr1000.bootloader.tool=openocd
luos_mkr1000.bootloader.file=mkr1000/samd21_sam_ba_arduino_mkr1000.bin

# Luos adapted Arduino MKRZero
# ---------------
luos_mkrzero.name=Luos adapted Arduino MKRZERO
luos_mkrzero.vid.0=0x2341
luos_mkrzero.pid.0=0x804f
luos_mkrzero.vid.1=0x2341
luos_mkrzero.pid.1=0x004f

luos_mkrzero.upload.tool=bossac
luos_mkrzero.upload.protocol=sam-ba
luos_mkrzero.upload.maximum_size=262144
luos_mkrzero.upload.maximum_data_size=32768
luos_mkrzero.upload.use_1200bps_touch=true
luos_mkrzero.upload.wait_for_upload_port=true
luos_mkrzero.upload.native_usb=true
luos_mkrzero.build.mcu=cortex-m0plus
luos_mkrzero.build.f_cpu=48000000L
luos_mkrzero.build.usb_product="Arduino MKRZero"
luos_mkrzero.build.usb_manufacturer="Arduino LLC"
luos_mkrzero.build.board=SAMD_MKRZERO
luos_mkrzero.build.core=arduino
luos_mkrzero.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
luos_mkrzero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrzero.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrzero.build.variant=mkrzero-luos
luos_mkrzero.build.vid=0x2341
luos_mkrzero.build.pid=0x804f
luos_mkrzero.bootloader.tool=openocd
luos_mkrzero.bootloader.file=mkrzero/samd21_sam_ba_arduino_mkrzero.bin

# Luos adapted Arduino MKR WiFi 1010
# --------------------
luos_mkrwifi1010.name=Luos adapted Arduino MKR WiFi 1010
luos_mkrwifi1010.vid.0=0x2341
luos_mkrwifi1010.pid.0=0x8054
luos_mkrwifi1010.vid.1=0x2341
luos_mkrwifi1010.pid.1=0x0054

luos_mkrwifi1010.upload.tool=bossac
luos_mkrwifi1010.upload.protocol=sam-ba
luos_mkrwifi1010.upload.maximum_size=262144
luos_mkrwifi1010.upload.maximum_data_size=32768
luos_mkrwifi1010.upload.use_1200bps_touch=true
luos_mkrwifi1010.upload.wait_for_upload_port=true
luos_mkrwifi1010.upload.native_usb=true
luos_mkrwifi1010.build.mcu=cortex-m0plus
luos_mkrwifi1010.build.f_cpu=48000000L
luos_mkrwifi1010.build.usb_product="Arduino MKR WiFi 1010"
luos_mkrwifi1010.build.usb_manufacturer="Arduino LLC"
luos_mkrwifi1010.build.board=SAMD_MKRWIFI1010
luos_mkrwifi1010.build.core=arduino
luos_mkrwifi1010.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
luos_mkrwifi1010.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrwifi1010.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrwifi1010.build.variant=mkrwifi1010-luos
luos_mkrwifi1010.build.vid=0x2341
luos_mkrwifi1010.build.pid=0x8054
luos_mkrwifi1010.bootloader.tool=openocd
luos_mkrwifi1010.bootloader.file=mkrwifi1010/samd21_sam_ba_arduino_mkrwifi1010.bin
#luos_mkrwifi1010.arduinoota.extraflags=-d

# Luos adapted Arduino NANO 33 IoT
# --------------------
luos_nano_33_iot.name=Luos adapted Arduino NANO 33 IoT
luos_nano_33_iot.vid.0=0x2341
luos_nano_33_iot.pid.0=0x8057
luos_nano_33_iot.vid.1=0x2341
luos_nano_33_iot.pid.1=0x0057

luos_nano_33_iot.upload.tool=bossac
luos_nano_33_iot.upload.protocol=sam-ba
luos_nano_33_iot.upload.maximum_size=262144
luos_nano_33_iot.upload.maximum_data_size=32768
luos_nano_33_iot.upload.use_1200bps_touch=true
luos_nano_33_iot.upload.wait_for_upload_port=true
luos_nano_33_iot.upload.native_usb=true
luos_nano_33_iot.build.mcu=cortex-m0plus
luos_nano_33_iot.build.f_cpu=48000000L
luos_nano_33_iot.build.usb_product="Arduino NANO 33 IoT"
luos_nano_33_iot.build.usb_manufacturer="Arduino LLC"
luos_nano_33_iot.build.board=SAMD_NANO_33_IOT
luos_nano_33_iot.build.core=arduino
luos_nano_33_iot.build.extra_flags=-DCRYSTALLESS -D__SAMD21G18A__ {build.usb_flags}
luos_nano_33_iot.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_nano_33_iot.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_nano_33_iot.build.variant=nano_33_iot-luos
luos_nano_33_iot.build.vid=0x2341
luos_nano_33_iot.build.pid=0x8057
luos_nano_33_iot.bootloader.tool=openocd
luos_nano_33_iot.bootloader.file=nano_33_iot/samd21_sam_ba_arduino_nano_33_iot.bin

