Luos-io/Arduino_core/boards.txt
# Luos adapted Arduino MKR FOX 1200
# --------------------
luos_mkrfox1200.name=Luos adapted Arduino MKR FOX 1200
luos_mkrfox1200.vid.0=0x2341
luos_mkrfox1200.pid.0=0x8050
luos_mkrfox1200.vid.1=0x2341
luos_mkrfox1200.pid.1=0x0050

luos_mkrfox1200.upload.tool=bossac
luos_mkrfox1200.upload.protocol=sam-ba
luos_mkrfox1200.upload.maximum_size=262144
luos_mkrfox1200.upload.maximum_data_size=32768
luos_mkrfox1200.upload.use_1200bps_touch=true
luos_mkrfox1200.upload.wait_for_upload_port=true
luos_mkrfox1200.upload.native_usb=true
luos_mkrfox1200.build.mcu=cortex-m0plus
luos_mkrfox1200.build.f_cpu=48000000L
luos_mkrfox1200.build.usb_product="Arduino MKR FOX 1200"
luos_mkrfox1200.build.usb_manufacturer="Arduino LLC"
luos_mkrfox1200.build.board=SAMD_MKRFox1200
luos_mkrfox1200.build.core=arduino
luos_mkrfox1200.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
luos_mkrfox1200.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrfox1200.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrfox1200.build.variant=mkrfox1200-luos
luos_mkrfox1200.build.vid=0x2341
luos_mkrfox1200.build.pid=0x8050
luos_mkrfox1200.bootloader.tool=openocd
luos_mkrfox1200.bootloader.file=mkrfox1200/samd21_sam_ba_arduino_mkrfox1200.bin

# Luos adapted Arduino MKR WAN 1300
# --------------------
luos_mkrwan1300.name=Luos adapted Arduino MKR WAN 1300
luos_mkrwan1300.vid.0=0x2341
luos_mkrwan1300.pid.0=0x8053
luos_mkrwan1300.vid.1=0x2341
luos_mkrwan1300.pid.1=0x0053

luos_mkrwan1300.upload.tool=bossac
luos_mkrwan1300.upload.protocol=sam-ba
luos_mkrwan1300.upload.maximum_size=262144
luos_mkrwan1300.upload.maximum_data_size=32768
luos_mkrwan1300.upload.use_1200bps_touch=true
luos_mkrwan1300.upload.wait_for_upload_port=true
luos_mkrwan1300.upload.native_usb=true
luos_mkrwan1300.build.mcu=cortex-m0plus
luos_mkrwan1300.build.f_cpu=48000000L
luos_mkrwan1300.build.usb_product="Arduino MKR WAN 1300"
luos_mkrwan1300.build.usb_manufacturer="Arduino LLC"
luos_mkrwan1300.build.board=SAMD_MKRWAN1300
luos_mkrwan1300.build.core=arduino
luos_mkrwan1300.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
luos_mkrwan1300.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrwan1300.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrwan1300.build.variant=mkrwan1300-luos
luos_mkrwan1300.build.vid=0x2341
luos_mkrwan1300.build.pid=0x8053
luos_mkrwan1300.bootloader.tool=openocd
luos_mkrwan1300.bootloader.file=mkrwan1300/samd21_sam_ba_arduino_mkrwan1300.bin

# Luos adapted Arduino MKR WAN 1310
# --------------------
luos_mkrwan1310.name=Luos adapted Arduino MKR WAN 1310
luos_mkrwan1310.vid.0=0x2341
luos_mkrwan1310.pid.0=0x8059
luos_mkrwan1310.vid.1=0x2341
luos_mkrwan1310.pid.1=0x0059

luos_mkrwan1310.upload.tool=bossac
luos_mkrwan1310.upload.protocol=sam-ba
luos_mkrwan1310.upload.maximum_size=262144
luos_mkrwan1310.upload.maximum_data_size=32768
luos_mkrwan1310.upload.use_1200bps_touch=true
luos_mkrwan1310.upload.wait_for_upload_port=true
luos_mkrwan1310.upload.native_usb=true
luos_mkrwan1310.build.mcu=cortex-m0plus
luos_mkrwan1310.build.f_cpu=48000000L
luos_mkrwan1310.build.usb_product="Arduino MKR WAN 1310"
luos_mkrwan1310.build.usb_manufacturer="Arduino LLC"
luos_mkrwan1310.build.board=SAMD_MKRWAN1310
luos_mkrwan1310.build.core=arduino
luos_mkrwan1310.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC -DVERY_LOW_POWER
luos_mkrwan1310.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrwan1310.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrwan1310.build.variant=mkrwan1300-luos
luos_mkrwan1310.build.vid=0x2341
luos_mkrwan1310.build.pid=0x8059
luos_mkrwan1310.bootloader.tool=openocd
luos_mkrwan1310.bootloader.file=mkrwan1300/samd21_sam_ba_arduino_mkrwan1310.bin

# Luos adapted Arduino MKR GSM 1400
# --------------------
luos_mkrgsm1400.name=Luos adapted Arduino MKR GSM 1400
luos_mkrgsm1400.vid.0=0x2341
luos_mkrgsm1400.pid.0=0x8052
luos_mkrgsm1400.vid.1=0x2341
luos_mkrgsm1400.pid.1=0x0052

luos_mkrgsm1400.upload.tool=bossac
luos_mkrgsm1400.upload.protocol=sam-ba
luos_mkrgsm1400.upload.maximum_size=262144
luos_mkrgsm1400.upload.maximum_data_size=32768
luos_mkrgsm1400.upload.use_1200bps_touch=true
luos_mkrgsm1400.upload.wait_for_upload_port=true
luos_mkrgsm1400.upload.native_usb=true
luos_mkrgsm1400.build.mcu=cortex-m0plus
luos_mkrgsm1400.build.f_cpu=48000000L
luos_mkrgsm1400.build.usb_product="Arduino MKR GSM 1400"
luos_mkrgsm1400.build.usb_manufacturer="Arduino LLC"
luos_mkrgsm1400.build.board=SAMD_MKRGSM1400
luos_mkrgsm1400.build.core=arduino
luos_mkrgsm1400.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
luos_mkrgsm1400.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrgsm1400.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrgsm1400.build.variant=mkrgsm1400-luos
luos_mkrgsm1400.build.vid=0x2341
luos_mkrgsm1400.build.pid=0x8052
luos_mkrgsm1400.bootloader.tool=openocd
luos_mkrgsm1400.bootloader.file=mkrgsm1400/samd21_sam_ba_arduino_mkrgsm1400.bin

# Luos adapted Arduino MKR NB 1500
# --------------------
luos_mkrnb1500.name=Luos adapted Arduino MKR NB 1500
luos_mkrnb1500.vid.0=0x2341
luos_mkrnb1500.pid.0=0x8055
luos_mkrnb1500.vid.1=0x2341
luos_mkrnb1500.pid.1=0x0055

luos_mkrnb1500.upload.tool=bossac
luos_mkrnb1500.upload.protocol=sam-ba
luos_mkrnb1500.upload.maximum_size=262144
luos_mkrnb1500.upload.maximum_data_size=32768
luos_mkrnb1500.upload.use_1200bps_touch=true
luos_mkrnb1500.upload.wait_for_upload_port=true
luos_mkrnb1500.upload.native_usb=true
luos_mkrnb1500.build.mcu=cortex-m0plus
luos_mkrnb1500.build.f_cpu=48000000L
luos_mkrnb1500.build.usb_product="Arduino MKR NB 1500"
luos_mkrnb1500.build.usb_manufacturer="Arduino LLC"
luos_mkrnb1500.build.board=SAMD_MKRNB1500
luos_mkrnb1500.build.core=arduino
luos_mkrnb1500.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
luos_mkrnb1500.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrnb1500.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrnb1500.build.variant=mkrnb1500-luos
luos_mkrnb1500.build.vid=0x2341
luos_mkrnb1500.build.pid=0x8055
luos_mkrnb1500.bootloader.tool=openocd
luos_mkrnb1500.bootloader.file=mkrnb1500/samd21_sam_ba_arduino_mkrnb1500.bin

# Luos adapted Arduino MKR Vidor 4000
# --------------------
luos_mkrvidor4000.name=Luos adapted Arduino MKR Vidor 4000
luos_mkrvidor4000.vid.0=0x2341
luos_mkrvidor4000.pid.0=0x8056
luos_mkrvidor4000.vid.1=0x2341
luos_mkrvidor4000.pid.1=0x0056

