Luos-io/Arduino_core/boards.txt
luos_mkrvidor4000.upload.tool=bossacI
luos_mkrvidor4000.upload.protocol=sam-ba
luos_mkrvidor4000.upload.maximum_size=262144
luos_mkrvidor4000.upload.maximum_data_size=32768
luos_mkrvidor4000.upload.use_1200bps_touch=true
luos_mkrvidor4000.upload.wait_for_upload_port=true
luos_mkrvidor4000.upload.native_usb=true
luos_mkrvidor4000.build.mcu=cortex-m0plus
luos_mkrvidor4000.build.f_cpu=48000000L
luos_mkrvidor4000.build.usb_product="Arduino MKR Vidor 4000"
luos_mkrvidor4000.build.usb_manufacturer="Arduino LLC"
luos_mkrvidor4000.build.board=SAMD_MKRVIDOR4000
luos_mkrvidor4000.build.core=arduino
luos_mkrvidor4000.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
luos_mkrvidor4000.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mkrvidor4000.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mkrvidor4000.build.variant=mkrvidor4000-luos
luos_mkrvidor4000.build.vid=0x2341
luos_mkrvidor4000.build.pid=0x8056
luos_mkrvidor4000.bootloader.tool=openocd
luos_mkrvidor4000.bootloader.file=mkrvidor4000/samd21_sam_ba_arduino_mkrvidor4000.bin

# Luos adapted Adafruit Circuit Playground M0
# ------------------------------
luos_adafruit_circuitplayground_m0.name=Luos adapted Adafruit Circuit Playground Express
luos_adafruit_circuitplayground_m0.vid.0=0x239A
luos_adafruit_circuitplayground_m0.pid.0=0x8018
luos_adafruit_circuitplayground_m0.vid.1=0x239A
luos_adafruit_circuitplayground_m0.pid.1=0x0018
luos_adafruit_circuitplayground_m0.upload.tool=bossac
luos_adafruit_circuitplayground_m0.upload.protocol=sam-ba
luos_adafruit_circuitplayground_m0.upload.maximum_size=262144
luos_adafruit_circuitplayground_m0.upload.maximum_data_size=32768
luos_adafruit_circuitplayground_m0.upload.use_1200bps_touch=true
luos_adafruit_circuitplayground_m0.upload.wait_for_upload_port=true
luos_adafruit_circuitplayground_m0.upload.native_usb=true
luos_adafruit_circuitplayground_m0.build.mcu=cortex-m0plus
luos_adafruit_circuitplayground_m0.build.f_cpu=48000000L
luos_adafruit_circuitplayground_m0.build.usb_product="Circuit Playground Express"
luos_adafruit_circuitplayground_m0.build.usb_manufacturer="Adafruit"
luos_adafruit_circuitplayground_m0.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
luos_adafruit_circuitplayground_m0.build.core=arduino
luos_adafruit_circuitplayground_m0.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ {build.usb_flags}
luos_adafruit_circuitplayground_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_adafruit_circuitplayground_m0.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_adafruit_circuitplayground_m0.build.variant=circuitplay-luos
luos_adafruit_circuitplayground_m0.build.variant_system_lib=
luos_adafruit_circuitplayground_m0.build.vid=0x239A
luos_adafruit_circuitplayground_m0.build.pid=0x8018
luos_adafruit_circuitplayground_m0.bootloader.tool=openocd
luos_adafruit_circuitplayground_m0.bootloader.file=circuitplay/circuitplay_m0_samd21g18_sam_ba.bin

# Luos adapted Arduino M0 PRO (with) bootloader - Programming port
# ---------------------------------------------------
luos_mzero_pro_bl_dbg.name=Luos adapted Arduino M0 Pro (Programming Port)
luos_mzero_pro_bl_dbg.vid.0=0x03eb
luos_mzero_pro_bl_dbg.pid.0=0x2111
luos_mzero_pro_bl_dbg.upload.tool=openocd-withbootsize
luos_mzero_pro_bl_dbg.upload.protocol=sam-ba
luos_mzero_pro_bl_dbg.upload.maximum_size=262144
luos_mzero_pro_bl_dbg.upload.maximum_data_size=32768
luos_mzero_pro_bl_dbg.upload.use_1200bps_touch=false
luos_mzero_pro_bl_dbg.upload.wait_for_upload_port=false
luos_mzero_pro_bl_dbg.upload.native_usb=false
luos_mzero_pro_bl_dbg.build.mcu=cortex-m0plus
luos_mzero_pro_bl_dbg.build.f_cpu=48000000L
luos_mzero_pro_bl_dbg.build.usb_product="Arduino M0 Pro"
luos_mzero_pro_bl_dbg.build.board=SAM_ZERO
luos_mzero_pro_bl_dbg.build.core=arduino
luos_mzero_pro_bl_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
luos_mzero_pro_bl_dbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mzero_pro_bl_dbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mzero_pro_bl_dbg.build.variant=arduino_mzero-luos
luos_mzero_pro_bl_dbg.build.variant_system_lib=
luos_mzero_pro_bl_dbg.build.vid=0x2a03
luos_mzero_pro_bl_dbg.build.pid=0x804f
luos_mzero_pro_bl_dbg.build.preferred_out_format=hex
luos_mzero_pro_bl_dbg.bootloader.size=0x4000

luos_mzero_pro_bl_dbg.bootloader.tool=openocd-withbootsize
luos_mzero_pro_bl_dbg.bootloader.cmd_unprotect=at91samd bootloader 0
luos_mzero_pro_bl_dbg.bootloader.cmd_protect=at91samd bootloader 16384
luos_mzero_pro_bl_dbg.bootloader.cmd_protect_verify=at91samd bootloader
luos_mzero_pro_bl_dbg.bootloader.file=mzero/Bootloader_D21_M0_Pro_150427.hex

# Luos adapted Arduino M0 PRO (with) bootloader - Native port
# ----------------------------------------------
luos_mzero_pro_bl.name=Luos adapted Arduino M0 Pro (Native USB Port)
luos_mzero_pro_bl.vid.0=0x2a03
luos_mzero_pro_bl.pid.0=0x004d
luos_mzero_pro_bl.vid.1=0x2a03
luos_mzero_pro_bl.pid.1=0x804d
luos_mzero_pro_bl.vid.2=0x2a03
luos_mzero_pro_bl.pid.2=0x004f
luos_mzero_pro_bl.vid.3=0x2a03
luos_mzero_pro_bl.pid.3=0x804f
luos_mzero_pro_bl.upload.tool=avrdude
luos_mzero_pro_bl.upload.protocol=stk500v2
luos_mzero_pro_bl.upload.maximum_size=262144
luos_mzero_pro_bl.upload.maximum_data_size=32768
luos_mzero_pro_bl.upload.use_1200bps_touch=true
luos_mzero_pro_bl.upload.wait_for_upload_port=true
luos_mzero_pro_bl.upload.native_usb=true
luos_mzero_pro_bl.upload.speed=57600
luos_mzero_pro_bl.build.mcu=cortex-m0plus
luos_mzero_pro_bl.build.f_cpu=48000000L
luos_mzero_pro_bl.build.usb_product="Arduino M0 Pro"
luos_mzero_pro_bl.build.board=SAM_ZERO
luos_mzero_pro_bl.build.core=arduino
luos_mzero_pro_bl.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
luos_mzero_pro_bl.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mzero_pro_bl.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mzero_pro_bl.build.variant=arduino_mzero-luos
luos_mzero_pro_bl.build.variant_system_lib=
luos_mzero_pro_bl.build.vid=0x2a03
luos_mzero_pro_bl.build.pid=0x804f
luos_mzero_pro_bl.build.preferred_out_format=hex
luos_mzero_pro_bl.bootloader.size=0x4000
luos_mzero_pro_bl.build.emu.mcu=atmega2560
luos_mzero_pro_bl.bootloader.tool=openocd-withbootsize
luos_mzero_pro_bl.bootloader.file=mzero/Bootloader_D21_M0_Pro_150427.hex
luos_mzero_pro_bl.bootloader.low_fuses=0xff

