Luos-io/Arduino_core/boards.txt
# Luos adapted Arduino M0 (with) Bootloader
# ----------------------------
luos_mzero_bl.name=Luos adapted Arduino M0
luos_mzero_bl.vid.0=0x2a03
luos_mzero_bl.pid.0=0x004d
luos_mzero_bl.vid.1=0x2a03
luos_mzero_bl.pid.1=0x804d
luos_mzero_bl.vid.2=0x2a03
luos_mzero_bl.pid.2=0x004e
luos_mzero_bl.vid.3=0x2a03
luos_mzero_bl.pid.3=0x804e
luos_mzero_bl.upload.tool=avrdude
luos_mzero_bl.upload.protocol=stk500v2
luos_mzero_bl.upload.maximum_size=262144
luos_mzero_bl.upload.maximum_data_size=32768
luos_mzero_bl.upload.use_1200bps_touch=true
luos_mzero_bl.upload.wait_for_upload_port=true
luos_mzero_bl.upload.native_usb=true
luos_mzero_bl.upload.speed=57600
luos_mzero_bl.build.mcu=cortex-m0plus
luos_mzero_bl.build.f_cpu=48000000L
luos_mzero_bl.build.usb_product="Arduino M0"
luos_mzero_bl.build.board=SAM_ZERO
luos_mzero_bl.build.core=arduino
luos_mzero_bl.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
luos_mzero_bl.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_mzero_bl.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_mzero_bl.build.variant=arduino_mzero-luos
luos_mzero_bl.build.variant_system_lib=
luos_mzero_bl.build.vid=0x2a03
luos_mzero_bl.build.pid=0x804e
luos_mzero_bl.build.preferred_out_format=hex
luos_mzero_bl.bootloader.size=0x4000
luos_mzero_bl.build.emu.mcu=atmega2560
luos_mzero_bl.bootloader.tool=openocd-withbootsize
luos_mzero_bl.bootloader.low_fuses=0xff
luos_mzero_bl.bootloader.file=mzero/Bootloader_D21_M0_150515.hex

# Luos adapted Arduino Tian (with) Bootloader
# ------------------------------
luos_tian.name=Luos adapted Arduino Tian
luos_tian.upload.via_ssh=true
luos_tian.vid.0=0x10C4
luos_tian.pid.0=0xEA70
luos_tian.descriptor.0=Enhanced Com Port

luos_tian.upload.tool=avrdude
#luos_tian.upload.protocol=stk500v2
luos_tian.upload.protocol=wiring
luos_tian.upload.maximum_size=262144
luos_tian.upload.maximum_data_size=32768
luos_tian.upload.use_1200bps_touch=true
luos_tian.upload.wait_for_upload_port=true
luos_tian.upload.native_usb=true
luos_tian.upload.speed=57600
luos_tian.build.mcu=cortex-m0plus
luos_tian.build.f_cpu=48000000L
luos_tian.build.usb_product="Arduino Tian"
luos_tian.build.board=SAMD_TIAN
luos_tian.build.core=arduino
luos_tian.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
luos_tian.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
luos_tian.build.openocdscript=openocd_scripts/arduino_zero.cfg
luos_tian.build.variant=arduino_mzero-luos
luos_tian.build.variant_system_lib=
luos_tian.build.vid=0x2a03
luos_tian.build.pid=0x8052
luos_tian.build.preferred_out_format=hex
luos_tian.bootloader.size=0x4000
luos_tian.build.emu.mcu=atmega2560
luos_tian.bootloader.tool=openocd-withbootsize
luos_tian.bootloader.low_fuses=0xff
luos_tian.bootloader.file=sofia/Sofia_Tian_151118.hex
luos_tian.drivers=SiliconLabs-CP2105/Silicon Labs VCP Driver.pkg

# Luos adapted Arduino Tian Console port (not for upload)
# ------------------------------------------
luos_tian_cons.name=Luos adapted Arduino Tian (MIPS Console port)
luos_tian_cons.vid.0=0x10C4
luos_tian_cons.pid.0=0xEA70
luos_tian_cons.descriptor.0=Standard Com Port
luos_tian_cons.hide=true
luos_tian_cons.build.board=SAMD_TIAN
